In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv('titanic_toy.csv')

In [3]:
df.head()

    Age     Fare  Family  Survived
0  22.0   7.2500       1         0
1  38.0  71.2833       1         1
2  26.0   7.9250       0         1
3  35.0  53.1000       1         1
4  35.0   8.0500       0         0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       714 non-null    float64
 1   Fare      846 non-null    float64
 2   Family    891 non-null    int64
 3   Survived  891 non-null    int64
dtypes: float64(2), int64(2)
memory usage: 28.0 KB

In [6]:
df.isnull().mean()*100

Age         19.865320
Fare         5.050505
Family       0.000000
Survived     0.000000
dtype: float64

In [37]:
X=df.iloc[:,:-1]
Y=df['Survived']

In [39]:
from sklearn.model_selection import train_test_split

In [40]:
X_train,X_test,y_train,y_test=train_test_split(X,Y,random_state=2,test_size=0.2)

In [41]:
X_train.head()

      Age     Fare  Family
30   40.0  27.7208       0
10    4.0  16.7000       2
873  47.0   9.0000       0
182   9.0  31.3875       6
876  20.0   9.8458       0

In [43]:
X_train['Age'].isnull().mean()

0.20786516853932585

In [44]:
X_train['Age'].mean()

29.78590425531915

In [45]:
X_train['Age_mean']=X_train['Age'].fillna(X_train['Age'].mean())
X_train['Age_median']=X_train['Age'].fillna(X_train['Age'].median())

In [46]:
X_train['Fare_mean']=X_train['Fare'].fillna(X_train['Age'].mean())
X_train['Fare_median']=X_train['Fare'].fillna(X_train['Age'].median())

In [50]:
X_train.sample(10)

      Age      Fare  Family   Age_mean  Age_median   Fare_mean  Fare_median
63    4.0   27.9000       5   4.000000        4.00   27.900000      27.9000
195  58.0  146.5208       0  58.000000       58.00  146.520800     146.5208
297   2.0  151.5500       3   2.000000        2.00  151.550000     151.5500
674   NaN    0.0000       0  29.785904       28.75    0.000000       0.0000
202  34.0    6.4958       0  34.000000       34.00    6.495800       6.4958
25   38.0   31.3875       6  38.000000       38.00   31.387500      31.3875
102  21.0   77.2875       1  21.000000       21.00   77.287500      77.2875
434  50.0       NaN       1  50.000000       50.00   29.785904      28.7500
188  40.0   15.5000       2  40.000000       40.00   15.500000      15.5000
161  40.0   15.7500       0  40.000000       40.00   15.750000      15.7500

In [51]:
print('Original Age variable variance: ', X_train['Age'].var())
print('Age Variance after median imputation: ', X_train['Age_median'].var())
print('Age Variance after mean imputation: ', X_train['Age_mean'].var())

Original Age variable variance:  204.34951339046142
Age Variance after median imputation:  161.98956633460548
Age Variance after mean imputation:  161.81262452718676